In [1]:
import pandas as pd
from pandasql import sqldf

#reminder
from datetime import datetime
print(datetime.now())

2020-10-22 20:22:19.166628

In [2]:
#creating dataframes

df_Census = pd.read_csv('Data_Sets/Census_Data_-_Selected_socioeconomic_indicators_in_Chicago__2008___2012-v2.csv')
df_Crime = pd.read_csv('Data_Sets/Chicago_Crime_Data-v2.csv')
df_Schools = pd.read_csv('Data_Sets/Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012-v3.csv')

In [3]:
type(df_Census)

pandas.core.frame.DataFrame

In [4]:
#creating SQL instance

pysqldf = lambda q: sqldf(q, globals())

In [5]:
#How many Crimes recorded?

record =  '''select count(id) as Total_Crime from df_Crime;'''
pysqldf(record)

   Total_Crime
0          533

### Viewing the first 5 rows of data frames, in order to have general information about them.

In [6]:
df_Census_5 = '''select * from df_Census LIMIT 5;'''
df_Crime_5 = '''select * from df_Crime LIMIT 5;'''
df_Schools_5 = '''select * from df_Schools LIMIT 5;'''

In [47]:
pysqldf(df_Census_5)

,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,PERCENT OF HOUSING CROWDED,PERCENT HOUSEHOLDS BELOW POVERTY,PERCENT AGED 16+ UNEMPLOYED,PERCENT AGED 25+ WITHOUT HIGH SCHOOL DIPLOMA,PERCENT AGED UNDER 18 OR OVER 64,PER_CAPITA_INCOME,HARDSHIP_INDEX
0,1.0,ROGERS PARK,7.7,23.6,8.7,18.2,27.5,23939,39.0
1,2.0,WEST RIDGE,7.8,17.2,8.8,20.8,38.5,23040,46.0
2,3.0,UPTOWN,3.8,24.0,8.9,11.8,22.2,35787,20.0
3,4.0,LINCOLN SQUARE,3.4,10.9,8.2,13.4,25.5,37524,17.0
4,5.0,NORTH CENTER,0.3,7.5,5.2,4.5,26.2,57123,6.0

In [27]:
pysqldf(df_Crime_5)

,ID,CASE_NUMBER,DATE,BLOCK,IUCR,PRIMARY_TYPE,DESCRIPTION,LOCATION_DESCRIPTION,ARREST,DOMESTIC,BEAT,DISTRICT,WARD,COMMUNITY_AREA_NUMBER,FBICODE,X_COORDINATE,Y_COORDINATE,YEAR,UPDATEDON,LATITUDE,LONGITUDE,LOCATION
0,3512276,HK587712,08/28/2004 05:50:56 PM,047XX S KEDZIE AVE,890,THEFT,FROM BUILDING,SMALL RETAIL STORE,0,0,911,9,14.0,58.0,6,1155838.0,1873050.0,2004,02/10/2018 03:50:01 PM,41.807441,-87.703956,"(41.8074405, -87.703955849)"
1,3406613,HK456306,06/26/2004 12:40:00 PM,009XX N CENTRAL PARK AVE,820,THEFT,$500 AND UNDER,OTHER,0,0,1112,11,27.0,23.0,6,1152206.0,1906127.0,2004,02/28/2018 03:56:25 PM,41.898280,-87.716406,"(41.898279962, -87.716405505)"
2,8002131,HT233595,04/04/2011 05:45:00 AM,043XX S WABASH AVE,820,THEFT,$500 AND UNDER,NURSING HOME/RETIREMENT HOME,0,0,221,2,3.0,38.0,6,1177436.0,1876313.0,2011,02/10/2018 03:50:01 PM,41.815933,-87.624642,"(41.815933131, -87.624642127)"
3,7903289,HT133522,12/30/2010 04:30:00 PM,083XX S KINGSTON AVE,840,THEFT,FINANCIAL ID THEFT: OVER $300,RESIDENCE,0,0,423,4,7.0,46.0,6,1194622.0,1850125.0,2010,02/10/2018 03:50:01 PM,41.743665,-87.562463,"(41.743665322, -87.562462756)"
4,10402076,HZ138551,02/02/2016 07:30:00 PM,033XX W 66TH ST,820,THEFT,$500 AND UNDER,ALLEY,0,0,831,8,15.0,66.0,6,1155240.0,1860661.0,2016,02/10/2018 03:50:01 PM,41.773455,-87.706480,"(41.773455295, -87.706480471)"

In [28]:
pysqldf(df_Schools_5)

,School ID,NAME_OF_SCHOOL,"Elementary, Middle, or High School",Street Address,City,State,ZIP Code,Phone Number,Link,Network Manager,Collaborative Name,Adequate Yearly Progress Made?,Track Schedule,CPS Performance Policy Status,CPS Performance Policy Level,HEALTHY_SCHOOL_CERTIFIED,Safety Icon,SAFETY_SCORE,Family Involvement Icon,Family Involvement Score,Environment Icon,Environment Score,Instruction Icon,Instruction Score,Leaders Icon,Leaders Score,Teachers Icon,Teachers Score,Parent Engagement Icon,Parent Engagement Score,Parent Environment Icon,Parent Environment Score,AVERAGE_STUDENT_ATTENDANCE,Rate of Misconducts (per 100 students),Average Teacher Attendance,Individualized Education Program Compliance Rate,Pk-2 Literacy %,Pk-2 Math %,Gr3-5 Grade Level Math %,Gr3-5 Grade Level Read %,Gr3-5 Keep Pace Read %,Gr3-5 Keep Pace Math %,Gr6-8 Grade Level Math %,Gr6-8 Grade Level Read %,Gr6-8 Keep Pace Math%,Gr6-8 Keep Pace Read %,Gr-8 Explore Math %,Gr-8 Explore Read %,ISAT Exceeding Math %,ISAT Exceeding Reading %,ISAT Value Add Math,ISAT Value Add Read,ISAT Value Add Color Math,ISAT Value Add Color Read,Students Taking Algebra %,Students Passing Algebra %,9th Grade EXPLORE (2009),9th Grade EXPLORE (2010),10th Grade PLAN (2009),10th Grade PLAN (2010),Net Change EXPLORE and PLAN,11th Grade Average ACT (2011),Net Change PLAN and ACT,College Eligibility %,Graduation Rate %,College Enrollment Rate %,COLLEGE_ENROLLMENT,General Services Route,Freshman on Track Rate %,X_COORDINATE,Y_COORDINATE,Latitude,Longitude,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,Ward,Police District,Location
0,610038,Abraham Lincoln Elementary School,ES,615 W Kemper Pl,Chicago,IL,60614,(773) 534-5720,http://schoolreports.cps.edu/SchoolProgressRep...,Fullerton Elementary Network,NORTH-NORTHWEST SIDE COLLABORATIVE,No,Standard,Not on Probation,Level 1,Yes,Very Strong,99.0,Very Strong,99,Strong,74.0,Strong,66.0,Strong,65,Strong,70,Strong,56,Average,47,96.00%,2.0,96.40%,95.80%,80.1,43.3,89.6,84.9,60.7,62.6,81.9,85.2,52,62.4,66.3,77.9,69.7,64.4,0.2,0.9,Yellow,Green,67.1,54.5,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,813,33,NDA,1171699.458,1915829.428,41.924497,-87.644522,7,LINCOLN PARK,43,18,"(41.92449696, -87.64452163)"
1,610281,Adam Clayton Powell Paideia Community Academy ...,ES,7511 S South Shore Dr,Chicago,IL,60649,(773) 535-6650,http://schoolreports.cps.edu/SchoolProgressRep...,Skyway Elementary Network,SOUTH SIDE COLLABORATIVE,No,Track_E,Not on Probation,Level 1,No,Average,54.0,Strong,66,Strong,74.0,Very Strong,84.0,Strong,63,Strong,76,Weak,46,Average,50,95.60%,15.7,95.30%,100.00%,62.4,51.7,21.9,15.1,29,42.8,38.5,27.4,44.8,42.7,14.1,34.4,16.8,16.5,0.7,1.4,Green,Green,17.2,27.3,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,521,46,NDA,1196129.985,1856209.466,41.760324,-87.556736,43,SOUTH SHORE,7,4,"(41.76032435, -87.55673627)"
2,610185,Adlai E Stevenson Elementary School,ES,8010 S Kostner Ave,Chicago,IL,60652,(773) 535-2280,http://schoolreports.cps.edu/SchoolProgressRep...,Midway Elementary Network,SOUTHWEST SIDE COLLABORATIVE,No,Standard,Not on Probation,Level 2,No,Strong,61.0,NDA,NDA,Average,50.0,Weak,36.0,NDA,NDA,NDA,NDA,Average,47,Weak,41,95.70%,2.3,94.70%,98.30%,53.7,26.6,38.3,34.7,43.7,57.3,48.8,39.2,46.8,44,7.5,21.9,18.3,15.5,-0.9,-1.0,Red,Red,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,1324,44,NDA,1148427.165,1851012.215,41.747111,-87.731702,70,ASHBURN,13,8,"(41.74711093, -87.73170248)"
3,609993,Agustin Lara Elementary Academy,ES,4619 S Wolcott Ave,Chicago,IL,60609,(773) 535-4389,http://schoolreports.cps.edu/SchoolProgressRep...,Pershing Elementary Network,SOUTHWEST SIDE COLLABORATIVE,No,Track_E,Not on Probation,Level 1,No,Average,56.0,Average,44,Average,45.0,Weak,37.0,Strong,65,Average,48,Average,53,Strong,58,95.50%,10.4,95.80%,100.00%,76.9,NDA,26,24.7,61.8,49.7,39.2,27.2,69.7,60.6,9.1,18.2,11.1,9.6,0.9,2.4,Green,Green,42.9,25,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,556,42,NDA,1164504.290,1873959.199,41.809757,-87.672145,61,NEW CITY,20,9,"(41.8097569, -87.6721446)"
4,610513,Air Force Academy High School,HS,3630 S Wells St,Chicago,IL,60609,(773) 535-1590,http://schoolreports.cps.edu/SchoolProgressRep...,Southwest Side High School Network,SOUTHWEST SIDE COLLABORATIVE,NDA,Standard,Not on Probation,Not Enough Data,Yes,Average,49.0,Strong,60,Strong,60.0,Average,55.0,Average,45,Average,54,Average,53,Average,49,93.30%,15.6,96.90%,100.00%,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NDA,NaN,NaN,NaN,NaN,NDA,NDA,NDA,NDA,14.6,14.8,NDA,16,1.4,NDA,NDA,NDA,NDA,NDA,302,40,91.8,1175177.622,1880745.126,41.828146,-87.632794,34,ARMOUR SQUARE,11,9,"(41.82814609, -87.63279369)"

In [10]:
# How many crimes involve an arrest?

arrested = '''select count(id) as Arrested from df_Crime where arrest = 1;'''
pysqldf(arrested)

   Arrested
0       163

In [11]:
# Which unique types of crimes have been recorded at RESIDENCE locations?

Residence_Crimes = '''select distinct primary_type as In_Residence from df_Crime 
                        where location_description = 'RESIDENCE';'''
pysqldf(Residence_Crimes)

                        In_Residence
0                              THEFT
1                            BATTERY
2                    CRIMINAL DAMAGE
3                      OTHER OFFENSE
4                            ASSAULT
5                           BURGLARY
6                 DECEPTIVE PRACTICE
7                            ROBBERY
8                  CRIMINAL TRESPASS
9                       PROSTITUTION
10                 WEAPONS VIOLATION
11        OFFENSE INVOLVING CHILDREN
12                             ARSON
13                          STALKING
14                         OBSCENITY
15  NON-CRIMINAL (SUBJECT SPECIFIED)

In [12]:
# In the CENSUS_DATA table list all Community Areas whose names start with the letter ‘W’

Census_w = ''' select COMMUNITY_AREA_NAME from df_Census where COMMUNITY_AREA_NAME like 'W%'  '''
pysqldf(Census_w)

  COMMUNITY_AREA_NAME
0          West Ridge
1           West Town
2  West Garfield Park
3     Washington Park
4            Woodlawn
5        West Pullman
6         West Elsdon
7           West Lawn
8      West Englewood
9   Washington Height

In [13]:
# Which schools are defined as 'safety school' in Lincoln Park. 

Safety_Schools = '''select name_of_school from df_Schools where community_area_name = 'LINCOLN PARK' 
                    and  healthy_school_certified = 'Yes';'''
pysqldf(Safety_Schools)

                      NAME_OF_SCHOOL
0  Abraham Lincoln Elementary School

In [14]:
# What is the average school Safety Score?

Average_Safety = '''select AVG(safety_score) as Average_Safety_Score from df_Schools;'''
pysqldf(Average_Safety)

   Average_Safety_Score
0             49.504873

In [15]:
df_Schools.shape

(566, 78)

In [16]:
df_Crime.shape

(533, 22)

In [17]:
df_Census.shape

(78, 9)

In [18]:
# to view all columns
pd.set_option('display.max_columns', 78)

In [19]:
# Top 5 safe areas.
Safer_Areas = '''select community_area_name as Community_Areas, avg(safety_score) as Average_Safety_Score 
                 from df_Schools group by community_area_name order by avg(safety_score) desc LIMIT 5;'''
pysqldf(Safer_Areas)

   Community_Areas  Average_Safety_Score
0      FOREST GLEN             99.000000
1             LOOP             92.000000
2  MOUNT GREENWOOD             86.500000
3     NORTH CENTER             85.166667
4     LINCOLN PARK             81.833333

In [20]:
# Average Hardship Index (Top 5)
avr_hardship = '''select community_area_name as Community_Areas, HARDSHIP_INDEX
                  as Hardship_Index from df_Census
                  group by community_area_name order by HARDSHIP_INDEX desc LIMIT 5;'''
pysqldf(avr_hardship)

  Community_Areas  Hardship_Index
0       Riverdale            98.0
1     Fuller Park            97.0
2  South Lawndale            96.0
3       Englewood            94.0
4       Gage Park            93.0

In [21]:
# Hardship Index (Min 5)
avr_hardship = '''select community_area_name as Community_Areas, HARDSHIP_INDEX
                  as Hardship_Index from df_Census
                  group by community_area_name order by HARDSHIP_INDEX LIMIT 5;'''
pysqldf(avr_hardship)

   Community_Areas  Hardship_Index
0          CHICAGO             NaN
1  Near North Side             1.0
2     Lincoln Park             2.0
3             Loop             3.0
4        Lake View             5.0

In [22]:
# Average Hardship Index
chicago_hardship = '''select COMMUNITY_AREA_NAME, HARDSHIP_INDEX from df_Census where COMMUNITY_AREA_NAME = 'CHICAGO';'''
pysqldf(chicago_hardship)

  COMMUNITY_AREA_NAME HARDSHIP_INDEX
0             CHICAGO           None

In [23]:
chicago_row = '''select * from df_Census where COMMUNITY_AREA_NAME = 'Near North Side';'''
pysqldf(chicago_row)

,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,PERCENT OF HOUSING CROWDED,PERCENT HOUSEHOLDS BELOW POVERTY,PERCENT AGED 16+ UNEMPLOYED,PERCENT AGED 25+ WITHOUT HIGH SCHOOL DIPLOMA,PERCENT AGED UNDER 18 OR OVER 64,PER_CAPITA_INCOME,HARDSHIP_INDEX
0,8.0,Near North Side,1.9,12.9,7.0,2.5,22.6,88669,1.0

In [24]:
# Delete false row
df_Census = df_Census[df_Census['COMMUNITY_AREA_NAME'] !='CHICAGO']

In [38]:
# Hardship Index (Min 5)
avr_hardship = '''select community_area_name as Community_Areas, HARDSHIP_INDEX
                  as Hardship_Index from df_Census
                  group by community_area_name order by HARDSHIP_INDEX LIMIT 5;'''
pysqldf(avr_hardship)

   Community_Areas  Hardship_Index
0  Near North Side             1.0
1     Lincoln Park             2.0
2             Loop             3.0
3        Lake View             5.0
4     North Center             6.0

In [39]:
area_income = '''select PER_CAPITA_INCOME from df_Census'''
pysqldf(area_income)

PandaSQLException: (sqlite3.OperationalError) no such column: PER_CAPITA_INCOME
[SQL: select PER_CAPITA_INCOME from df_Census]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [40]:
# We can get a result by writing the column names with spaces at the end in reverse quotes.
area_income = '''select `PER_CAPITA_INCOME ` from df_Census'''
pysqldf(area_income)

    PER_CAPITA_INCOME
0                23939
1                23040
2                35787
3                37524
4                57123
..                 ...
72               19713
73               34381
74               27149
75               25828
76               33385

[77 rows x 1 columns]

In [36]:
df_Census.columns

Index(['COMMUNITY_AREA_NUMBER', 'COMMUNITY_AREA_NAME',
       'PERCENT OF HOUSING CROWDED', 'PERCENT HOUSEHOLDS BELOW POVERTY',
       'PERCENT AGED 16+ UNEMPLOYED',
       'PERCENT AGED 25+ WITHOUT HIGH SCHOOL DIPLOMA',
       'PERCENT AGED UNDER 18 OR OVER 64', 'PER_CAPITA_INCOME ',
       'HARDSHIP_INDEX'],
      dtype='object')

In [46]:
df_Census['COMMUNITY_AREA_NAME'] = df_Census['COMMUNITY_AREA_NAME'].str.upper()

In [50]:
# Relationship between crime rate and mean income.

crime_income = '''select df_Census.community_area_name as Area_Name, avg(df_Census.`PER_CAPITA_INCOME `) as Income,
                df_Schools.SAFETY_SCORE from df_Census JOIN df_Schools on 
                df_Census.community_area_name = df_Schools.community_area_name group by Area_Name order by Area_Name;'''

pysqldf(crime_income)

         Area_Name   Income  SAFETY_SCORE
0      ALBANY PARK  21323.0           NaN
1   ARCHER HEIGHTS  16134.0          43.0
2    ARMOUR SQUARE  16148.0          32.0
3          ASHBURN  23482.0          20.0
4   AUBURN GRESHAM  15528.0           NaN
..             ...      ...           ...
69       WEST LAWN  16907.0          42.0
70    WEST PULLMAN  16563.0           NaN
71      WEST RIDGE  23040.0          47.0
72       WEST TOWN  43198.0          31.0
73        WOODLAWN  18672.0           NaN

[74 rows x 3 columns]

In [57]:
# to prevent NaN values not affecting the average.

crime_income_nan = '''select df_Census.community_area_name as Area_Name, df_Census.`PER_CAPITA_INCOME ` as Income,
                df_Schools.SAFETY_SCORE from df_Census JOIN df_Schools on 
                df_Census.community_area_name = df_Schools.community_area_name 
                where df_Schools.SAFETY_SCORE is not null order by Area_Name ;'''

pysqldf(crime_income_nan)

       Area_Name  Income  SAFETY_SCORE
0    ALBANY PARK   21323          66.0
1    ALBANY PARK   21323          43.0
2    ALBANY PARK   21323          43.0
3    ALBANY PARK   21323          75.0
4    ALBANY PARK   21323          67.0
..           ...     ...           ...
497     WOODLAWN   18672          19.0
498     WOODLAWN   18672          31.0
499     WOODLAWN   18672          29.0
500     WOODLAWN   18672          13.0
501     WOODLAWN   18672          70.0

[502 rows x 3 columns]

In [59]:
# Relationship between crime rate and mean income.

crime_income = '''select df_Census.community_area_name as Area_Name, avg(df_Census.`PER_CAPITA_INCOME `) as Income,
                df_Schools.SAFETY_SCORE from df_Census JOIN df_Schools on 
                df_Census.community_area_name = df_Schools.community_area_name 
                where df_Schools.SAFETY_SCORE is not null
                group by Area_Name order by Income;'''

pysqldf(crime_income)

             Area_Name   Income  SAFETY_SCORE
0            RIVERDALE   8201.0          53.0
1       SOUTH LAWNDALE  10402.0          40.0
2          FULLER PARK  10432.0          38.0
3   WEST GARFIELD PARK  10934.0          41.0
4       WEST ENGLEWOOD  11317.0          31.0
..                 ...      ...           ...
68     NEAR SOUTH SIDE  59077.0          67.0
69           LAKE VIEW  60058.0          73.0
70                LOOP  65526.0          92.0
71        LINCOLN PARK  71551.0          99.0
72     NEAR NORTH SIDE  88669.0          50.0

[73 rows x 3 columns]